DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main.c
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief TIM3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM3_Init(void)
{

  /* USER CODE BEGIN TIM3_Init 0 */

  /* USER CODE END TIM3_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM3_Init 1 */

  /* USER CODE END TIM3_Init 1 */
  htim3.Instance = TIM3;
  htim3.Init.Prescaler = 168;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 65535;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim3) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM3_Init 2 */

  /* USER CODE END TIM3_Init 2 */

}

/**
  * @brief TIM4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM4_Init(void)
{

  /* USER CODE BEGIN TIM4_Init 0 */

  /* USER CODE END TIM4_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM4_Init 1 */

  /* USER CODE END TIM4_Init 1 */
  htim4.Instance = TIM4;
  htim4.Init.Prescaler = 168;
  htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim4.Init.Period = 10000;
  htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim4) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim4, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim4, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM4_Init 2 */

  /* USER CODE END TIM4_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  /* USER CODE BEGIN MX_GPIO_Init_1 */
  __HAL_RCC_SYSCFG_CLK_ENABLE();  // КРИТИЧНО: включает мультиплексор прерываний EXTI
  __HAL_RCC_PWR_CLK_ENABLE();     // Тактирование модуля питания (для G4)
  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
// ============================================================================
// Отправка 64-байтного пакета хосту (используется SDK)
// ============================================================================
extern uint8_t USBD_CUSTOM_HID_SendReport(USBD_HandleTypeDef* pdev, uint8_t* report, uint16_t len);
extern USBD_HandleTypeDef hUsbDeviceFS;

uint8_t PacketSend(uint8_t* buffer) {
    // Отправка HID отчёта (64 байта)
    return USBD_CUSTOM_HID_SendReport(&hUsbDeviceFS, buffer, 64);
}

// ============================================================================
// СЕКЦИЯ: МОТОР ОСИ X 
// ============================================================================

volatile int32_t X_PWM_CURRENT = 0; // Уставка мощности/тока для ШИМ-контроллера

/**
 * @brief Инициализация таймера TIM2 для управления мотором X
 * @param mode: Режим работы (STEP, ONE_PWM или TWO_PWM)
 */
void XMotorInit(X_MOTOR_MODE_T mode) {
    // Если режим не изменился, ничего не делаем
    if (X_MOTOR_MODE == mode) return;

    // Полный сброс периферии таймера 2 и включение тактирования
    __HAL_RCC_TIM2_FORCE_RESET();
    __HAL_RCC_TIM2_RELEASE_RESET();
    __HAL_RCC_TIM2_CLK_ENABLE();

    // Базовая конфигурация таймера
    htim2.Instance = TIM2;
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;      // Счет вверх
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim2.Init.RepetitionCounter = 0;
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    if (mode == X_MOTOR_MODE_STEP) {
        // --- РЕЖИМ STEP (Шаговый двигатель) ---
        // Прескалер 169: частоту 170МГц делим на 170 -> получаем тик 1 микросекунда
        htim2.Init.Prescaler = 169; 
        htim2.Init.Period = 10000; // Период по умолчанию
        
        // One Pulse Mode: таймер сделает один цикл счета и остановится (для шага)
        HAL_TIM_OnePulse_Init(&htim2, TIM_OPMODE_SINGLE); 
        
        // Настройка NVIC
        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
        
        // Включаем прерывание только по обновлению (конец шага)
        __HAL_TIM_ENABLE_IT(&htim2, TIM_IT_UPDATE);
			
				TIM2->EGR |= TIM_EGR_UG;   // Синхронизируем регистры немедленно
        TIM2->SR = 0;              // Сбрасываем флаги, которые мог поднять UG
        TIM2->CR1 |= TIM_CR1_CEN;  // Запускаем первый такт планировщика			
    } 
    else {
// --- РЕЖИМ PWM (Коллекторный мотор) ---
        if (mode == X_MOTOR_MODE_ONE_PWM) {
            // 96MHz / (18+1) = 5.05MHz. 5.05MHz / 5000 ≈ 1.01kHz
            htim2.Init.Prescaler = 18; 
            htim2.Init.Period = 4940; // Как в твоем исходнике
        } else { // TWO_PWM
            // 96MHz / (9+1) = 9.6MHz. 9.6MHz / 9880 ≈ 0.97kHz
            htim2.Init.Prescaler = 9; 
            htim2.Init.Period = 9880; // Как в твоем исходнике
        }
        
        HAL_TIM_Base_Init(&htim2);
        
        // Отключаем One Pulse Mode
        TIM2->CR1 &= ~TIM_CR1_OPM; 

        // Режим Timing для программного ШИМ (прерывания CC)
        TIM_OC_InitTypeDef sConfigOC = {0};
        sConfigOC.OCMode = TIM_OCMODE_TIMING;
        HAL_TIM_OC_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

        // Настройка прерываний (Приоритет 5 может быть низковат, но пока оставляем)
        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
        
        // ВКЛЮЧАЕМ прерывания: Update (конец периода) и CC1 (момент переключения ШИМ)
        __HAL_TIM_ENABLE_IT(&htim2, TIM_IT_UPDATE | TIM_IT_CC1);
        
        // Синхронизация и запуск
        TIM2->EGR |= TIM_EGR_UG; 
        TIM2->SR = 0;             // Чистим флаги после UG
        TIM2->CR1 |= TIM_CR1_CEN;
    }
    
    // Сохраняем текущий режим
    X_MOTOR_MODE = mode;
}

/**
 * @brief Программная задержка для защиты силовых ключей (DeadTime)
 * Предотвращает сквозной ток при переключении плеч моста.
 */
__STATIC_INLINE void XMotorDeadTime(void) {
    // Примерно 1 мкс при 170 МГц (зависит от оптимизации компилятора)
    for (volatile int i = 0; i < 100; i++) { __NOP(); } 
}

/**
 * @brief Единый обработчик прерываний TIM2
 * Обрабатывает и начало периода (UIF), и момент выключения импульса (CC1IF).
 */
void TIM2_IRQHandler(void) {
    // Читаем регистр статуса один раз для скорости
    uint32_t sr = TIM2->SR;

    // --- ОБРАБОТКА НАЧАЛА ТАКТА (Update Event) ---
    if (sr & TIM_SR_UIF) {
        TIM2->SR = ~TIM_SR_UIF; // Сбрасываем флаг прерывания
        
