DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main.c
    // Настройка: 8-бит ИСТОЧНИК -> 8-бит ПРИЕМНИК
    DMA2_Channel1->CCR = DMA_CCR_MEM2MEM |             
                         DMA_CCR_TCIE |                
                         DMA_CCR_TEIE |                
                         (0x01 << DMA_CCR_PL_Pos) |    
                         (0x00 << DMA_CCR_MSIZE_Pos) | // 0x00 = 8-bit
                         (0x00 << DMA_CCR_PSIZE_Pos) | // 0x00 = 8-bit
                         DMA_CCR_MINC |                
                         DMA_CCR_PINC;

    HAL_NVIC_SetPriority(DMA2_Channel1_IRQn, 3, 0); 
    HAL_NVIC_EnableIRQ(DMA2_Channel1_IRQn);
}

void FIFO_DATA_StartDma(uint32_t src, uint32_t dst, uint16_t count) {
    // В 8-битном режиме проверка (src & 0x3) больше НЕ НУЖНА.
    
    LPP_DataReady = 0; 
    
    // 1. Принудительно выключаем
    DMA2_Channel1->CCR &= ~DMA_CCR_EN;
    
    // 2. Ждем готовности (защита от перегрузки канала)
    // Если DMA зависнет, здесь может быть вечный цикл. 
    // В идеале добавить счетчик попыток, но для лазера оставим так.
    while(DMA2_Channel1->CCR & DMA_CCR_EN);
    
    // 3. Сброс флагов (обязательно перед новым запуском)
    DMA2->IFCR = DMA_IFCR_CGIF1;
    
    // 4. Загрузка параметров
    DMA2_Channel1->CPAR = src;    // Откуда (адрес байта в памяти)
    DMA2_Channel1->CMAR = dst;    // Куда (адрес байта в памяти)
    DMA2_Channel1->CNDTR = count; // Сколько БАЙТ (в нашем случае 44)
    
    // 5. Поехали
    DMA2_Channel1->CCR |= DMA_CCR_EN;
}

void DMA2_Channel1_IRQHandler(void) 
{
    uint32_t isr = DMA2->ISR;
    
    // Завершение передачи
    if (isr & DMA_ISR_TCIF1) {
        DMA2->IFCR = DMA_IFCR_CTCIF1;
        LPP_DataReady = 1;
        FIFO_DATA_EndDma(); // Если эта функция существует
    }
    
    // Ошибка передачи
    if (isr & DMA_ISR_TEIF1) {
        DMA2->IFCR = DMA_IFCR_CTEIF1;
        LPP_DataReady = 1; // Или специальный код ошибки
        // TODO: логирование ошибки
    }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
